## MODIFICAR VALORES DE COLUNA(S)

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

MODIFICAR VALORES DE COLUNAS UTILIZANDO ATRIBUIÇÃO DIRETA

In [3]:
# utilizando atribuição direta
df["NOME"] = df['NOME'].str.title() 
df

     NOME  ALTURA  PESO  IDADE
0   Maria    1.77    65     40
1  Sandra    1.65    72     20

com atribuição direta podemos modificar valores das colunas utilizando métodos, operadores, valores únicos etc.

In [4]:
df["NOME"], df['ALTURA'] = df['NOME'].str.lower(), df['ALTURA']*100
df

     NOME  ALTURA  PESO  IDADE
0   maria   177.0    65     40
1  sandra   165.0    72     20

como visto, podemos modificar várias colunas numa mesma linha utilizando vírgulas para separar os valores.

MODIFICAR VALORES DE COLUNA UTILIZANDO O MÉTODO .replace()

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.replace.html

In [5]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

In [6]:
df['NOME'].replace('Sandra', 'sandra')

0     MARIA
1    sandra
Name: NOME, dtype: object

In [7]:
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

In [8]:
df['NOME'].replace({'MARIA':'Maria', 'Sandra':'Joana'})

0    Maria
1    Joana
Name: NOME, dtype: object

podemos usar um dicionário para modificar os valores de uma coluna, podemos usar regex, mas não aceita métodos, operadores, funções

In [9]:
df['NOME'] = df['NOME'].replace({'MARIA':'Maria', 'Sandra':'Joana'})
df

    NOME  ALTURA  PESO  IDADE
0  Maria    1.77    65     40
1  Joana    1.65    72     20

UTILIZANDO O MÉTODO .assign()

https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.assign.html

In [10]:
df = pd.DataFrame({'NOME':['MARIA','Sandra'],
              'ALTURA':[1.77,1.65],
              'PESO':[65, 72],
              'IDADE':[40, 20]})
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

o método assign permite modificar mais de uma coluna ao mesmo tempo e usar funções, métodos e operadores

In [11]:
df.assign(NOME = ['Carolina','Joana'], ALTURA = df['ALTURA']*100)

       NOME  ALTURA  PESO  IDADE
0  Carolina   177.0    65     40
1     Joana   165.0    72     20

podemos perceber que o método assign amodifica o valor da coluna já existente e aceita funções, métodos, operadores, lista etc

In [12]:
df

     NOME  ALTURA  PESO  IDADE
0   MARIA    1.77    65     40
1  Sandra    1.65    72     20

In [13]:
df = df.assign(NOME = ['Carolina','Joana'], ALTURA = df['ALTURA']*100)

In [14]:
df

       NOME  ALTURA  PESO  IDADE
0  Carolina   177.0    65     40
1     Joana   165.0    72     20